package dcein.springboot.demo.utils;

import org.junit.jupiter.api.Test;

import java.text.SimpleDateFormat;
import java.util.Date;

/**
 * @Auther: DingCong
 * @Description:
 * @@Date: Created in 14:28 2018/8/7
 */
public class Block {

 /*   @Test
    public void testP(){
        print();
    }


    *//**
     * 图形盛放容器
     *//*
    public String[][][] testBlock(){
        //step1.使用二维数组来盛放每个数字图形
        String number_0[][] = {{"*","*","*","*","*"},{"*"," "," "," ","*"},{"*"," "," "," ","*"},{"*"," "," "," ","*"},{"*"," "," "," ","*"},{"*"," "," "," ","*"},{"*","*","*","*","*"}};
        String number_1[][] = {{" "," ","*"," "," "},{" "," ","*"," "," "},{" "," ","*"," "," "},{" "," ","*"," "," "},{" "," ","*"," "," "},{" "," ","*"," "," "},{" "," ","*"," "," "}};
        String number_2[][] = {{"*","*","*","*","*"},{" "," "," "," ","*"},{" "," "," "," ","*"},{"*","*","*","*","*"},{"*"," "," "," "," "},{"*"," "," "," "," "},{"*","*","*","*","*"}};
        String number_3[][] = {{"*","*","*","*","*"},{" "," "," "," ","*"},{" "," "," "," ","*"},{"*","*","*","*","*"},{" "," "," "," ","*"},{" "," "," "," ","*"},{"*","*","*","*","*"}};
        String number_4[][] = {{"*"," "," ","*"," "},{"*"," "," ","*"," "},{"*"," "," ","*"," "},{"*","*","*","*","*"},{" "," "," ","*"," "},{" "," "," ","*"," "},{" "," "," ","*"," "}};
        String number_5[][] = {{"*","*","*","*","*"},{"*"," "," "," "," "},{"*"," "," "," "," "},{"*","*","*","*","*"},{" "," "," "," ","*"},{" "," "," "," ","*"},{"*","*","*","*","*"}};
        String number_6[][] = {{"*","*","*","*","*"},{"*"," "," "," "," "},{"*"," "," "," "," "},{"*","*","*","*","*"},{"*"," "," "," ","*"},{"*"," "," "," ","*"},{"*","*","*","*","*"}};
        String number_7[][] = {{"*","*","*","*","*"},{" "," "," "," ","*"},{" "," "," "," ","*"},{" "," "," "," ","*"},{" "," "," "," ","*"},{" "," "," "," ","*"},{" "," "," "," ","*"}};
        String number_8[][] = {{"*","*","*","*","*"},{"*"," "," "," ","*"},{"*"," "," "," ","*"},{"*","*","*","*","*"},{"*"," "," "," ","*"},{"*"," "," "," ","*"},{"*","*","*","*","*"}};
        String number_9[][] = {{"*","*","*","*","*"},{"*"," "," "," ","*"},{"*"," "," "," ","*"},{"*","*","*","*","*"},{" "," "," "," ","*"},{" "," "," "," ","*"},{"*","*","*","*","*"}};

        //step2.存放闪烁点
        String dot[][] = {{" "," "," "," "," "},{" "," "," "," "," "},{" "," ","*"," "," "},{" "," ","*"," "," "},{" "," ","*"," "," "},{" "," "," "," "," "},{" "," "," "," "," "}};

        //step3.数码显示位置
        String number_all[][][] = {number_0,number_1,number_2,number_3,number_4,number_5,number_6,number_7,number_8,number_9};

        //step4.日期格式化模板
        SimpleDateFormat sdf = new SimpleDateFormat("HH:mm");

        //step5.得到数字
        String[][][] dateArray = new String[5][][];
        String dateStr = sdf.format(new Date());
        char[] dateChars = dateStr.toCharArray();
        for (int i = 0; i < dateChars.length; i++) {
            switch (dateChars[i]) {
                case ':':
                    dateArray[i] = dot;
                    break;
                default:
                    dateArray[i] = number_all[Integer.valueOf(String.valueOf(dateChars[i]))];
                    break;
            }
        }

        return dateArray;
    }

    *//**
     * 打印数组类
     *//*
    public void print(){
        String[][][] data = testBlock();
        for(int m=5 ; m<5 ; m++){
            for (int j=0 ; j<data.length ; j++){        //外层数组行数
                for (int k=0 ; k<3 ; k++){ //内层数组的长度
                    System.out.print(data[j][m][k]);
                }
                System.out.println("");
            }
            System.out.println();
        }
    }*/



    public static String[][] num0 = {{"*","*","*","*","*"},{"*"," "," "," ","*"},{"*"," "," "," ","*"},{"*"," "," "," ","*"},{"*"," "," "," ","*"},{"*"," "," "," ","*"},{"*","*","*","*","*"}};
    public static String[][] num1 = {{" "," ","*"," "," "},{" "," ","*"," "," "},{" "," ","*"," "," "},{" "," ","*"," "," "},{" "," ","*"," "," "},{" "," ","*"," "," "},{" "," ","*"," "," "}};
    public static String[][] num2 = {{"*","*","*","*","*"},{" "," "," "," ","*"},{" "," "," "," ","*"},{"*","*","*","*","*"},{"*"," "," "," "," "},{"*"," "," "," "," "},{"*","*","*","*","*"}};
    public static String[][] num3 = {{"*","*","*","*","*"},{" "," "," "," ","*"},{" "," "," "," ","*"},{"*","*","*","*","*"},{" "," "," "," ","*"},{" "," "," "," ","*"},{"*","*","*","*","*"}};
    public static String[][] num4 = {{"*"," "," ","*"," "},{"*"," "," ","*"," "},{"*"," "," ","*"," "},{"*","*","*","*","*"},{" "," "," ","*"," "},{" "," "," ","*"," "},{" "," "," ","*"," "}};
    public static String[][] num5 = {{"*","*","*","*","*"},{"*"," "," "," "," "},{"*"," "," "," "," "},{"*","*","*","*","*"},{" "," "," "," ","*"},{" "," "," "," ","*"},{"*","*","*","*","*"}};
    public static String[][] num6 = {{"*","*","*","*","*"},{"*"," "," "," "," "},{"*"," "," "," "," "},{"*","*","*","*","*"},{"*"," "," "," ","*"},{"*"," "," "," ","*"},{"*","*","*","*","*"}};
    public static String[][] num7 = {{"*","*","*","*","*"},{" "," "," "," ","*"},{" "," "," "," ","*"},{" "," "," "," ","*"},{" "," "," "," ","*"},{" "," "," "," ","*"},{" "," "," "," ","*"}};
    public static String[][] num8 = {{"*","*","*","*","*"},{"*"," "," "," ","*"},{"*"," "," "," ","*"},{"*","*","*","*","*"},{"*"," "," "," ","*"},{"*"," "," "," ","*"},{"*","*","*","*","*"}};
    public static String[][] num9 = {{"*","*","*","*","*"},{"*"," "," "," ","*"},{"*"," "," "," ","*"},{"*","*","*","*","*"},{" "," "," "," ","*"},{" "," "," "," ","*"},{"*","*","*","*","*"}};

    //step2.存放闪烁点
    public static String[][] dot = new String[][]{{" "," "," "," "," "},{" "," "," "," "," "},{" "," ","*"," "," "},{" "," ","*"," "," "},{" "," ","*"," "," "},{" "," "," "," "," "},{" "," "," "," "," "}};

    public static String[][][] numAll = new String[][][] { num0, num1, num2, num3, num4, num5, num6, num7, num8, num9 };
    public static SimpleDateFormat sdf = new SimpleDateFormat("HH:mm");

    public static void main(String[] args) {
        print();
    }

    public static void print() {
        String[][][] newStr = getDateArray();
        for (int i = 0; i < 7; i++) {              //每个数码管的行数
            for (int k = 0; k < newStr.length; k++) {
                for (int j = 0; j < 5; j++) {      //每个数码管的列数
                    System.out.print(newStr[k][i][j]);
                }
                System.out.print(" ");
            }
            System.out.println();
        }
    }

    public static String[][][] getDateArray() {
        String[][][] dateArray = new String[5][][]; //一共五个位置
        String dateStr = sdf.format(new Date());
        char[] dateChars = dateStr.toCharArray();
        for (int i = 0; i < dateChars.length; i++) {
            switch (dateChars[i]) {
                case ':':
                    dateArray[i] = dot;
                    break;
                default:
                    dateArray[i] = numAll[Integer.valueOf(String.valueOf(dateChars[i]))];
                    break;
            }
        }

        return dateArray;
    }

}

